In [1]:
import pandas as pd

In [2]:
series1 = pd.Series([10,20,30,0,40])
series1

0    10
1    20
2    30
3     0
4    40
dtype: int64

In [3]:
data = {"ad": ["a", "b", "c"], "yas": [1,2,3]}
data

{'ad': ['a', 'b', 'c'], 'yas': [1, 2, 3]}

In [4]:
df = pd.DataFrame(data)
df

  ad  yas
0  a    1
1  b    2
2  c    3

In [5]:
df = pd.read_csv(r"C:\Users\PC\Desktop\AltinEx\Chocolate Sales.csv")
df

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344